app/controllers/jedis_controller.rb

  def index
    @jedis = Jedi.all
---
SELECT "jedis".* FROM "jedis"

  def create
    @jedi = Jedi.new(jedi_params)
    #@jedi.set_location(params['street_address'],params['street_address_2'])
    @jedi.set_location(params[:street_address],params[:street_address_2],params[:city],params[:postal_code],params[:county],params[:country])

    respond_to do |format|
      if @jedi.save
---
INSERT INTO "jedis" ("created_at", "first_name", "last_name", "picture", "sex", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-07-12 21:22:24.926411"], ["first_name", "Test"], ["last_name", "User"], ["picture", "100_0729.JPG"], ["sex", "Female"], ["updated_at", "2014-07-12 21:22:24.926411"]]

  def update
    respond_to do |format|
      if @jedi.update(jedi_params)
---
UPDATE "jedis" SET "location" = ?, "updated_at" = ? WHERE "jedis"."id" = 2  [["location", "1235 Green Road London EC1 2WG Greater London United Kingdom"], ["updated_at", "2014-07-19 18:17:01.026380"]]

  def destroy
    @jedi.destroy
---
DELETE FROM "jedis" WHERE "jedis"."id" = ?  [["id", 1]]

    def set_jedi
      @jedi = Jedi.find(params[:id])
---
SELECT  "jedis".* FROM "jedis"  WHERE "jedis"."id" = ? LIMIT 1  [["id", 2]]